
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьСервер();
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Функция ПечатьСервер()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Реализация);
	ТабДок = РеквизитФормыВЗначение("Объект"). СформироватьПечатнуюФормуДляТаможенногоОформления(МассивОбъектов);
	Возврат ТабДок;
КонецФункции


